In [ ]:
# importing numpy and pandas
import numpy as np
import pandas as pd

In [ ]:
ls

In [29]:
timesheet = pd.read_excel("timesheet.xlsx",sheet_name="time")
timesheet.head()

,Name,emp id,In time,Out time,max late,max early
0,Abhishek,TIA009,2025-01-07 11:00:00,2025-01-07 20:30:00,2025-01-07 11:10:00,2025-01-07 20:20:00
1,Aditi,TIA019,2025-01-07 10:00:00,2025-01-07 18:30:00,2025-01-07 10:10:00,2025-01-07 18:20:00
2,Santosh,TIA028,2025-01-07 09:00:00,2025-01-07 18:00:00,2025-01-07 09:10:00,2025-01-07 17:50:00
3,Bantubala,NaN,2025-01-07 11:30:00,2025-01-07 15:00:00,2025-01-07 11:40:00,2025-01-07 14:50:00
4,Purnima,TIA024,2025-01-07 10:00:00,2025-01-07 18:30:00,2025-01-07 10:10:00,2025-01-07 18:20:00

In [30]:
name_id = timesheet[["Name","emp id"]].set_index("Name").to_dict()['emp id']

In [31]:
# importing leave data
leave_data = pd.read_excel("leave_data.xlsx",sheet_name='leave')

# selecting only necessory column
leave_data =  leave_data[['Name','Leave Start Date','Leave End Date','Half Day/ Full Day?','Number of Days']]

# creating first name column
leave_data['first name'] = leave_data.apply(lambda x: x["Name"].split(' ')[0].strip(),axis=1)
leave_data.head()

,Name,Leave Start Date,Leave End Date,Half Day/ Full Day?,Number of Days,first name
0,Anjali Bohra,2022-03-21 00:00:00,2022-03-21 00:00:00,Full day,1.0,Anjali
1,Devendra Patidar,2022-03-24 00:00:00,2022-03-26 00:00:00,Full day,3.0,Devendra
2,Saheba Khan,2022-03-26 00:00:00,2022-03-26 00:00:00,Full day,1.0,Saheba
3,Saheba Khan,2022-03-29 00:00:00,2022-03-29 00:00:00,Full day,1.0,Saheba
4,Saheba Khan,2022-03-31 00:00:00,2022-03-31 00:00:00,Full day,1.0,Saheba

In [32]:
# looking up Employee id for leave data
leave_data["emp id"] = leave_data['first name'].apply(lambda x: name_id.get(x,np.nan) )

In [38]:
leave_data.head()

,Name,Leave Start Date,Leave End Date,Half Day/ Full Day?,Number of Days,first name,emp id
0,Anjali Bohra,2022-03-21 00:00:00,2022-03-21 00:00:00,Full day,1.0,Anjali,NaN
1,Devendra Patidar,2022-03-24 00:00:00,2022-03-26 00:00:00,Full day,3.0,Devendra,NaN
2,Saheba Khan,2022-03-26 00:00:00,2022-03-26 00:00:00,Full day,1.0,Saheba,TIA004
3,Saheba Khan,2022-03-29 00:00:00,2022-03-29 00:00:00,Full day,1.0,Saheba,TIA004
4,Saheba Khan,2022-03-31 00:00:00,2022-03-31 00:00:00,Full day,1.0,Saheba,TIA004

In [37]:
# finding people with no id
# leave_data[leave_data['emp id'].isna() ]['first name'].unique()

In [36]:
# leave_data.groupby(['first name','emp id'])['Number of Days'].sum()

In [39]:
# first working on user id data
user_data = open("user.dat","r").read()

# messy data in this file
user_data[:200]

# the file contain non ACSII and symboles that we dont need we are only keeping the data with numbers and char
a = ""
for i in user_data:
    if i.isalnum():
        a += i
    else:
        a += " "
a = a.split()

# variable a contain a list of name,id,name,id,name,id so we need 2 list name and id 
name = [a[i] for i in range(len(a)) if i%2==0]
user_id = [int(a[i]) for i in range(len(a)) if i%2==1]
# print("name- ",name)
# print("User id -",user_id)

# now converting this 2 list into one dictionary with id as key and name as value
user = dict(zip(user_id,name))
# print("Updated data in a dict",user)

# converting that dictionary to data frame
user_df = pd.DataFrame(user.values(),index=user.keys())
user_df.reset_index(inplace=True)
user_df.rename(columns={0:"Name","index":"id"},inplace=True)

# our work has done we get the data of users in this variable
user_df

    id       Name
0    1     Saheba
1    2     Lokesh
2    3     Hemant
3    4   Abhishek
4    5    Kuldeep
5    6        Dev
6    7  Siddharth
7    8       Ajay
8    9     Sachin
9   10      Varun
10  11      Priya
11  12      Bantu
12  13     Saloni
13  14   Priyanka
14  15     Govind
15  16      Purvi
16  17       Moiz
17  18    Gayatri
18  19   Shivangi
19  20      Aditi
20  21   Vaishali
21  22     Swarna
22  23     Devesh
23  24    Purnima
24  25     Arvind
25  26     Diksha
26  27    Santosh

In [48]:
user_df['emp id'] = user_df['Name'].apply(lambda x: name_id.get(x,np.nan))
user_df

    id       Name  emp id
0    1     Saheba  TIA004
1    2     Lokesh     NaN
2    3     Hemant     NaN
3    4   Abhishek  TIA009
4    5    Kuldeep  TIA013
5    6        Dev     NaN
6    7  Siddharth     NaN
7    8       Ajay  TIA011
8    9     Sachin  TIA012
9   10      Varun     NaN
10  11      Priya     NaN
11  12      Bantu     NaN
12  13     Saloni     NaN
13  14   Priyanka     NaN
14  15     Govind     NaN
15  16      Purvi     NaN
16  17       Moiz     NaN
17  18    Gayatri     NaN
18  19   Shivangi     NaN
19  20      Aditi  TIA019
20  21   Vaishali     NaN
21  22     Swarna     NaN
22  23     Devesh  TIA023
23  24    Purnima  TIA024
24  25     Arvind  TIA026
25  26     Diksha  TIA027
26  27    Santosh  TIA028

In [ ]:
# user_df.to_csv("row user data.csv")

In [45]:
# this is the main file which has the attendance data and reading it in csv
df = pd.read_csv("attendance.dat",header=None)

# because the data is in one column spliting it and keeping only the req. two columns so make these function that extract the data in first two columns

def get_id(text):
    return text.split("\t")[0]
def get_time(text):
    return text.split("\t")[1]

# creating two columns ID and punch_Time that hold the data when the employee punch in and out

df["id"]= df[0].map(get_id)
df["punch_time"] = df[0].map(get_time)
df.drop(columns=[0],inplace=True)   # deleting the raw data column and keeping only two column
df['id']= df["id"].astype(int)      # conerting id column to int

# now we get a clean data
df.to_csv("raw attendance data.csv")
df.head()

   id           punch_time
0   8  2024-12-02 08:39:37
1   9  2024-12-02 09:04:17
2  23  2024-12-02 09:17:46
3  25  2024-12-02 09:33:58
4  24  2024-12-02 09:54:28

In [46]:
df

     id           punch_time
0     8  2024-12-02 08:39:37
1     9  2024-12-02 09:04:17
2    23  2024-12-02 09:17:46
3    25  2024-12-02 09:33:58
4    24  2024-12-02 09:54:28
..   ..                  ...
438  26  2024-12-31 10:29:05
439   4  2024-12-31 10:44:18
440   1  2024-12-31 10:50:33
441   5  2024-12-31 10:59:04
442   9  2024-12-31 15:05:15

[443 rows x 2 columns]

In [49]:
user_df

    id       Name  emp id
0    1     Saheba  TIA004
1    2     Lokesh     NaN
2    3     Hemant     NaN
3    4   Abhishek  TIA009
4    5    Kuldeep  TIA013
5    6        Dev     NaN
6    7  Siddharth     NaN
7    8       Ajay  TIA011
8    9     Sachin  TIA012
9   10      Varun     NaN
10  11      Priya     NaN
11  12      Bantu     NaN
12  13     Saloni     NaN
13  14   Priyanka     NaN
14  15     Govind     NaN
15  16      Purvi     NaN
16  17       Moiz     NaN
17  18    Gayatri     NaN
18  19   Shivangi     NaN
19  20      Aditi  TIA019
20  21   Vaishali     NaN
21  22     Swarna     NaN
22  23     Devesh  TIA023
23  24    Purnima  TIA024
24  25     Arvind  TIA026
25  26     Diksha  TIA027
26  27    Santosh  TIA028

In [50]:
# merge the data of id and punch time data into one data frame

data = pd.merge(df,user_df,how="left",on="id")

In [51]:
# Combined data
data.head()

   id           punch_time     Name  emp id
0   8  2024-12-02 08:39:37     Ajay  TIA011
1   9  2024-12-02 09:04:17   Sachin  TIA012
2  23  2024-12-02 09:17:46   Devesh  TIA023
3  25  2024-12-02 09:33:58   Arvind  TIA026
4  24  2024-12-02 09:54:28  Purnima  TIA024

In [52]:
# extracting date and time 

data['datetime'] = pd.to_datetime(df['punch_time'])
data['date'] = pd.to_datetime(df['punch_time']).dt.date
data['in_out_time'] = pd.to_datetime(df['punch_time']).dt.time
data["am_pm"] = data['datetime'].dt.strftime("%p")
data.drop(columns="punch_time",inplace=True)     # no use of this column now
data.head()

   id     Name  emp id            datetime        date in_out_time am_pm
0   8     Ajay  TIA011 2024-12-02 08:39:37  2024-12-02    08:39:37    AM
1   9   Sachin  TIA012 2024-12-02 09:04:17  2024-12-02    09:04:17    AM
2  23   Devesh  TIA023 2024-12-02 09:17:46  2024-12-02    09:17:46    AM
3  25   Arvind  TIA026 2024-12-02 09:33:58  2024-12-02    09:33:58    AM
4  24  Purnima  TIA024 2024-12-02 09:54:28  2024-12-02    09:54:28    AM

# we have only one column of IN and OUT time of employee , so making two columns to seperate them

ampm = data.pivot_table(index=data.index,columns='am_pm',values='datetime',aggfunc="min")
ampm.reset_index(inplace=True)
ampm.rename(columns={"index":"row_id"},inplace=True)
ampm.head()

# merge both table into main data file

data = data.reset_index().rename(columns={"index":"row_id"})
data = pd.merge(data,ampm,how='left',on ='row_id')
data.head()

# importing timesheet of employee IN and OUT time

timesheet = pd.read_excel("timesheet.xlsx",sheet_name="time")
ts = timesheet[['Name','max late','max early']]

In [53]:
timesheet

,Name,emp id,In time,Out time,max late,max early
0,Abhishek,TIA009,2025-01-07 11:00:00,2025-01-07 20:30:00,2025-01-07 11:10:00,2025-01-07 20:20:00
1,Aditi,TIA019,2025-01-07 10:00:00,2025-01-07 18:30:00,2025-01-07 10:10:00,2025-01-07 18:20:00
2,Santosh,TIA028,2025-01-07 09:00:00,2025-01-07 18:00:00,2025-01-07 09:10:00,2025-01-07 17:50:00
3,Bantubala,NaN,2025-01-07 11:30:00,2025-01-07 15:00:00,2025-01-07 11:40:00,2025-01-07 14:50:00
4,Purnima,TIA024,2025-01-07 10:00:00,2025-01-07 18:30:00,2025-01-07 10:10:00,2025-01-07 18:20:00
5,Kuldeep,TIA013,2025-01-07 11:00:00,2025-01-07 18:00:00,2025-01-07 11:10:00,2025-01-07 17:50:00
6,Sachin,TIA012,2025-01-07 09:00:00,2025-01-07 18:00:00,2025-01-07 09:10:00,2025-01-07 17:50:00
7,Saheba,TIA004,2025-01-07 11:00:00,2025-01-07 18:30:00,2025-01-07 11:10:00,2025-01-07 18:20:00
8,Diksha,TIA027,2025-01-07 10:30:00,2025-01-07 18:30:00,2025-01-07 10:40:00,2025-01-07 18:20:00
9,Varun,NaN,2025-01-07 09:30:00,2025-01-07 18:00:00,2025-01-07 09:40:00,2025-01-07 17:50:00
10,Arvind,TIA026,2025-01-07 09:30:00,2025-01-07 18:00:00,2025-01-07 09:40:00,2025-01-07 17:50:00
11,Devesh,TIA023,2025-01-07 09:30:00,2025-01-07 18:00:00,2025-01-07 09:40:00,2025-01-07 17:50:00
12,Dev,NaN,2025-01-07 11:00:00,2025-01-07 20:30:00,2025-01-07 11:10:00,2025-01-07 20:20:00
13,Ajay,TIA011,2025-01-07 09:00:00,2025-01-07 18:00:00,2025-01-07 09:10:00,2025-01-07 17:50:00
14,Sakshee,NaN,2025-01-07 10:00:00,2025-01-07 19:00:00,2025-01-07 10:10:00,2025-01-07 18:50:00
15,Mahak,NaN,2025-01-07 10:00:00,2025-01-07 17:00:00,2025-01-07 10:10:00,2025-01-07 17:50:00

In [54]:
# merge time data to main dataframe

data = pd.merge(data,timesheet,how="left",on ='Name')
data.head()

,id,Name,emp id_x,datetime,date,in_out_time,am_pm,emp id_y,In time,Out time,max late,max early
0,8,Ajay,TIA011,2024-12-02 08:39:37,2024-12-02,08:39:37,AM,TIA011,2025-01-07 09:00:00,2025-01-07 18:00:00,2025-01-07 09:10:00,2025-01-07 17:50:00
1,9,Sachin,TIA012,2024-12-02 09:04:17,2024-12-02,09:04:17,AM,TIA012,2025-01-07 09:00:00,2025-01-07 18:00:00,2025-01-07 09:10:00,2025-01-07 17:50:00
2,23,Devesh,TIA023,2024-12-02 09:17:46,2024-12-02,09:17:46,AM,TIA023,2025-01-07 09:30:00,2025-01-07 18:00:00,2025-01-07 09:40:00,2025-01-07 17:50:00
3,25,Arvind,TIA026,2024-12-02 09:33:58,2024-12-02,09:33:58,AM,TIA026,2025-01-07 09:30:00,2025-01-07 18:00:00,2025-01-07 09:40:00,2025-01-07 17:50:00
4,24,Purnima,TIA024,2024-12-02 09:54:28,2024-12-02,09:54:28,AM,TIA024,2025-01-07 10:00:00,2025-01-07 18:30:00,2025-01-07 10:10:00,2025-01-07 18:20:00

In [57]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443 entries, 0 to 442
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           443 non-null    int64
 1   Name         443 non-null    object
 2   emp id_x     382 non-null    object
 3   datetime     443 non-null    datetime64[ns]
 4   date         443 non-null    object
 5   in_out_time  443 non-null    object
 6   am_pm        443 non-null    object
 7   emp id_y     382 non-null    object
 8   In time      392 non-null    datetime64[ns]
 9   Out time     392 non-null    datetime64[ns]
 10  max late     392 non-null    object
 11  max early    392 non-null    object
dtypes: datetime64[ns](3), int64(1), object(8)
memory usage: 41.7+ KB

In [61]:
data.head()

,id,Name,emp id_x,datetime,date,in_out_time,am_pm,emp id_y,In time,Out time,max late,max early
0,8,Ajay,TIA011,2024-12-02 08:39:37,2024-12-02,08:39:37,AM,TIA011,2025-01-07 09:00:00,2025-01-07 18:00:00,09:10:00,17:50:00
1,9,Sachin,TIA012,2024-12-02 09:04:17,2024-12-02,09:04:17,AM,TIA012,2025-01-07 09:00:00,2025-01-07 18:00:00,09:10:00,17:50:00
2,23,Devesh,TIA023,2024-12-02 09:17:46,2024-12-02,09:17:46,AM,TIA023,2025-01-07 09:30:00,2025-01-07 18:00:00,09:40:00,17:50:00
3,25,Arvind,TIA026,2024-12-02 09:33:58,2024-12-02,09:33:58,AM,TIA026,2025-01-07 09:30:00,2025-01-07 18:00:00,09:40:00,17:50:00
4,24,Purnima,TIA024,2024-12-02 09:54:28,2024-12-02,09:54:28,AM,TIA024,2025-01-07 10:00:00,2025-01-07 18:30:00,10:10:00,18:20:00

In [62]:
data.to_csv("main_data.csv")

# converting datetime into time

data['max late'] = data['max late'].dt.time
data['max early'] = data['max early'].dt.time
data['AM'] = data['AM'].dt.time
data['PM'] = data['PM'].dt.time
data.head()

# filling null values in AM column with max late and max early
data['AM'] = data['AM'].fillna(data['max late'])
data['PM'] = data['PM'].fillna(data['max early'])

data.info()

data['late_arival'] = data['AM']>data['max late']
data['early leave'] = data['PM']<data['max early']

late_data = data.groupby("Name").agg({"late_arival":"sum","early leave":"sum"})
late_data

# 'ta' stand for total attendance a temprary variable 
ta = pd.DataFrame(data.groupby(["Name",'date'])['date'].count()).rename({"date":"count"},axis=1).reset_index()
ta.head()

ta['present'] = 1
ta.head()

total_present = pd.DataFrame(ta.groupby("Name")['date'].count())
total_present

final = pd.merge(total_present,late_data,on='Name',how='left').reset_index()
# final

final.rename(columns={"date":"total_present_day"},inplace=True)

final['net_present_day']=final['total_present_day']-(final['late_arival']*0.5 + final['early leave']*0.5)
final

leave_data = pd.read_excel("leave_data.xlsx")

leave_data = leave_data[['Name','Number of Days','Leave Start Date','Leave End Date']]

leave_data['half_name'] = leave_data['Name'].map(lambda x : x.split()[0].strip())

leave_data

# counting datediff and excluding and sunday in between
def count_day_without_sunday(start_date,end_date):
    dates = pd.date_range(start=start_date,end=end_date)
    day = dates.day_name()
    day = day != "Sunday"
    return sum(day)

count_day_without_sunday("13-3-2025","18-3-2025")

leave_data['without sunday'] = leave_data.apply(lambda x: count_day_without_sunday(x['Leave Start Date'],x['Leave End Date']),axis=1)

leave_data['leave'] = leave_data.apply(lambda x: min(x['Number of Days'],x['without sunday']),axis=1)

leave_data

# total leave taken by employees
total_leave = pd.DataFrame(leave_data.groupby('half_name')['leave'].sum()).reset_index()
total_leave

# exporting total leave data to excel if you want
total_leave.to_csv("Total_leave.csv")

final

final = pd.merge(final,total_leave,left_on='Name',right_on="half_name",how="left")

final.drop(columns="half_name",inplace=True)
final.rename({"leave":"Leave"},axis=1,inplace=True)
final['Leave']= final['Leave'].fillna(0)
final.to_csv("FinalReport.csv")

final